In [5]:
import numpy as np
import pandas as pd

In [21]:
df = pd.DataFrame(np.random.randn(3,4), index=list('abc'), columns=['Apple','Granate','Melon','Fig'])
df

      Apple   Granate     Melon       Fig
a  1.663681 -0.254356  0.133359 -0.743351
b  0.283452 -0.078947  1.003140 -0.303039
c  0.171815 -0.260200 -0.365242  0.218470

In [22]:
np.abs(-5)

np.int64(5)

In [24]:
np.round(df)

   Apple  Granate  Melon  Fig
a    2.0     -0.0    0.0 -1.0
b    0.0     -0.0    1.0 -0.0
c    0.0     -0.0   -0.0  0.0

In [20]:
df

      Apple   Granate     Melon       Fig
a  0.218616  0.249795 -1.577345  1.942402
b -0.772788  0.639848 -0.183570  0.659415
c -1.495436  0.535153 -0.621710  3.095428

In [10]:
df.mean()

Olma     0.266164
Anor     0.200344
Qovun   -0.090572
Anjir   -0.041266
dtype: float64

In [11]:
df.apply(np.abs)

       Olma      Anor     Qovun     Anjir
a  0.325202  0.539700  0.187160  1.706108
b  0.425150  0.721175  0.020349  0.214408
c  0.048140  0.659842  0.479224  1.367901

In [26]:
df.apply(sum, axis=1)

a    0.799333
b    0.904606
c   -0.235157
dtype: float64

In [13]:
f = lambda x: x.max()-x.min()

In [27]:
df.apply(f)

Apple      1.491866
Granate    0.181253
Melon      1.368382
Fig        0.961821
dtype: float64

In [28]:
def foo(x):
  return pd.Series([x.min(),x.max()], index=['min','max'])

In [29]:
df.apply(foo)

        Apple   Granate     Melon       Fig
min  0.171815 -0.260200 -0.365242 -0.743351
max  1.663681 -0.078947  1.003140  0.218470

In [30]:
df

      Apple   Granate     Melon       Fig
a  1.663681 -0.254356  0.133359 -0.743351
b  0.283452 -0.078947  1.003140 -0.303039
c  0.171815 -0.260200 -0.365242  0.218470

In [32]:
df.map(lambda x: x*x)

      Apple   Granate     Melon       Fig
a  2.767834  0.064697  0.017785  0.552570
b  0.080345  0.006233  1.006289  0.091832
c  0.029520  0.067704  0.133402  0.047729